Revit 2026 API

# SpaceSetIterator Constructor

---

For Internal Use Only.

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public SpaceSetIterator()
```
```vb
Public Sub New
```
```cpp
public:
SpaceSetIterator()
```
```fsharp
new : unit -> SpaceSetIterator
```

This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.

#### Reference

SpaceSetIterator Class

Autodesk.Revit.DB.Mechanical Namespace